# Taps
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "d12frosted/emacs-plus"

# Install Mac App Store support tooling
brew "mas"

# Apps

mas "Bitwarden", id: 1352778147
mas "Drafts", id: 1435957248
mas "Pixelmator Pro", id: 1289583905
mas "Reeder 5", 1529448980
mas "Tot", id: 1491071483

# Casks
cask_args appdir: "~/Applications"

cask "amethyst"
cask "choosy"
cask "dash"
cask "doxygen"
cask "fantastical"
cask "firefox"
cask "font-fantasque-sans-mono"
cask "font-fantasque-sans-mono-nerd-font"
cask "gpg-suite-no-mail"
cask "hammerspoon"
cask "slack"
cask "suspicious-package"
cask "transmission"
cask "vivaldi"
cask "vlc"

# Utilities
brew "docker"
brew "docker-compose"
brew "colima" args: ["HEAD"]
brew "romkatv/powerlevel10k/powerlevel10k"
brew "binutils"
brew "coreutils"
brew "direnv"
brew "dnsmasq"
brew "editorconfig"
brew "fd"
brew "findutils"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "gh"
brew "gnu-sed"
brew "graphviz"
brew "helm"
brew "imagemagick"
brew "jansson"
brew "jq"
brew "moreutils"
brew "ncdu"
brew "openjdk"
brew "openssl"
brew "p7zip"
brew "pandoc"
brew "pinentry"
brew "pinentry-mac"
brew "ripgrep"
brew "shellcheck"
brew "terminal-notifier"
brew "terraform"
brew "tree"
brew "the_silver_searcher"
brew "unixodbc"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "yubico-piv-tool"
brew "yq"

# Build Tools
brew "autoconf"
brew "automake"
brew "ccache"
brew "ninja"
brew "pipenv"
brew "pkg-config"

# Shells
brew "bash"
brew "bash-completion"
brew "fish"

# Editors
brew "emacs-plus@28"
brew "neovim"

# Languages
brew "gcc"

# Tmux
brew "tmux"
brew "reattach-to-user-namespace"

# Databases
brew "postgresql"
brew "postgis"
brew "redis"
brew "sqlite"

# Libraries
brew "tree-sitter"
