fisherman/autoenvstack
edc/bass
fisherman/docker-completion
fisherman/git_util
fisherman/nvm
oh-my-fish/plugin-pbcopy
bitwalker/pure
fisherman/rvm
